SaitovSP/src/Catalogs/Клиенты/Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиенты</name>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

SaitovSP/src/Catalogs/Клиенты/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
	     Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Клиенты.Ссылка КАК Ссылка,
		|	Клиенты.ВерсияДанных КАК ВерсияДанных,
		|	Клиенты.ПометкаУдаления КАК ПометкаУдаления,
		|	Клиенты.Код КАК Код,
		|	Клиенты.Наименование КАК Наименование,
		|	Клиенты.Почта КАК Почта,
		|	Клиенты.НомерТелефона КАК НомерТелефона,
		|	Клиенты.Предопределенный КАК Предопределенный,
		|	Клиенты.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.НомерТелефона = &НомерТелефона
		|	И Клиенты.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	//Если Не Запрос.Выполнить().Пустой() Тогда
	//	Отказ = Истина;
	//	Сообщить("Такой пользователь уже есть");
	//КонецЕсли;
	//   
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отказ = Истина;
		Сообщить("Такой пользователь уже есть");
	КонецЦикла;

КонецПроцедуры
